<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = ''
USER = ''
PASSWORD = ''
HOST = ''
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [51]:
# текст запроса
query_3_1 = f'''
SELECT COUNT(v.id)
FROM vacancies v
'''

In [52]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [49]:
# текст запроса
query_3_2 = f'''
SELECT COUNT(e.id)
FROM employers e
'''

In [50]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [47]:
# текст запроса
query_3_3 = f'''
SELECT COUNT(a.id)
FROM areas a
'''

In [48]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [45]:
# текст запроса
query_3_4 = f'''
SELECT COUNT(i.id)
FROM industries i
'''

In [46]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''
SELECT
    COUNT(v.id) cnt,
    a.name
FROM vacancies v
JOIN areas a ON a.id = v.area_id
GROUP BY 2
ORDER BY 1 DESC
'''

In [14]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df.head(5)

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_96484/450191024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             name
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [53]:
# текст запроса
query_4_2 = f'''
SELECT
    COUNT(v.id) count
FROM vacancies v
WHERE v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL
'''

In [54]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [66]:
# текст запроса
query_4_3 = f'''
SELECT
    ROUND(AVG(v.salary_from), 0) avg_min,
    ROUND(AVG(v.salary_to), 0) avg_max
FROM vacancies v
'''

In [67]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   avg_min   avg_max
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [68]:
# текст запроса
query_4_4 = f'''
SELECT
    v.schedule,
    v.employment,
    COUNT(v.id)
FROM vacancies v
GROUP BY v.schedule, v.employment
ORDER BY 3 DESC
'''

In [69]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [72]:
# текст запроса
query_4_5 = f'''
SELECT
    v.experience,
    COUNT(v.experience)
FROM vacancies v
GROUP BY v.experience
ORDER BY 2 ASC
'''

In [73]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий
Ожидаемо больше всего вакансий в самых больших городах. Интересно, что больше всего соискателей обладают довольно малым опытом работы,
а более опытные соискатели реже находятся в поисках работы.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [28]:
# текст запроса
query_5_1 = f'''
SELECT
    e.name,
    COUNT(v.id)
FROM employers e
JOIN vacancies v ON e.id = v.employer_id
GROUP BY e.name
ORDER BY 2 DESC
'''

In [31]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
print(df.loc[0]['name'])
print(df.loc[4]['name'])

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_96484/1099325839.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

Яндекс
Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [100]:
# текст запроса
query_5_2 = f'''
SELECT
    a.name,
    COUNT(e.id) empl_count,
    COUNT(v.id) vac_count
FROM employers e 
LEFT JOIN areas a ON a.id = e.area
LEFT JOIN vacancies v ON v.area_id = a.id
GROUP BY a.name
ORDER BY 2
'''

In [101]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df = df[(df['vac_count'] == 0)]
df.sort_values(by='empl_count', ascending=False, ignore_index=True).loc[0]['name']

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_96484/1253149949.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

'Россия'

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [84]:
# текст запроса
query_5_3 = f'''
SELECT
    e.name,
    COUNT(DISTINCT v.area_id) areas_count
FROM employers e
JOIN vacancies v ON e.id = v.employer_id
GROUP BY e.name
ORDER BY 2 DESC
'''

In [85]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  areas_count
0                      Яндекс          181
1                  Ростелеком          152
2                  Спецремонт          116
3      Поляков Денис Иванович           88
4                   ООО ЕФИН            71
...                       ...          ...
14761                  UniSol            1
14762            UNISTORY LLC            1
14763                   UNIT6            1
14764     United Distribution            1
14765              UNITEL LLC            1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [86]:
# текст запроса
query_5_4 = f'''
SELECT
    COUNT(e.id)
FROM employers e
LEFT JOIN employers_industries ei ON ei.employer_id = e.id
WHERE ei.employer_id IS NULL
'''

In [87]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [90]:
# текст запроса
query_5_5 = f'''
SELECT
    e.name,
    COUNT(DISTINCT ei.industry_id) industry_count
FROM employers e
JOIN employers_industries ei ON ei.employer_id = e.id
GROUP BY e.id
HAVING COUNT(DISTINCT ei.industry_id) = 4
ORDER BY 1
OFFSET 2
LIMIT 1
'''

In [91]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name  industry_count
0  2ГИС               4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [180]:
# текст запроса
query_5_6 = f'''
SELECT
    COUNT(e.name)
FROM employers e
JOIN employers_industries ei ON ei.employer_id = e.id
JOIN industries i ON i.id = ei.industry_id
WHERE i.name = 'Разработка программного обеспечения'
'''

In [181]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_96484/821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [94]:
# код для получения списка городов-милионников
import requests
from bs4 import BeautifulSoup
def wiki_header(url):
    response = requests.get(url, headers={'User-Agent': 'Mozilla/5.0'})
    page = BeautifulSoup(response.text, 'html.parser')
    table = page.find('table', class_ = 'standard sortable')
    billion_cities = []
    for tr in table.find_all('tr')[1:]:
        td = tr.find_all('td')[1]
        billion_cities.append(td.a['title']) #получаем значение атрибута title тега <a href>
    return billion_cities


billion_cities = wiki_header('https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8')

/Users/solaris/Library/Python/3.8/lib/python/site-packages/urllib3/__init__.py:34: NotOpenSSLWarning: urllib3 v2.0 only supports OpenSSL 1.1.1+, currently the 'ssl' module is compiled with 'LibreSSL 2.8.3'. See: https://github.com/urllib3/urllib3/issues/3020
  warnings.warn(

In [95]:
# текст запроса
query_5_7 = f'''
(SELECT
    a.name,
    COUNT(v.id)
FROM employers e
JOIN vacancies v ON v.employer_id = e.id
JOIN areas a ON a.id  = v.area_id
WHERE e.name = 'Яндекс' AND a.name IN {tuple(billion_cities)}
GROUP BY a.name)
UNION ALL
(SELECT
    'total',
    COUNT(v.id)
FROM employers e
JOIN vacancies v ON v.employer_id = e.id
JOIN areas a ON a.id  = v.area_id
WHERE e.name = 'Яндекс' AND a.name IN {tuple(billion_cities)})
ORDER BY 2
'''

In [96]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            total    485

***

In [ ]:
# выводы по анализу работодателей
Конечно, в самых больших городах, самые популярные компании открывают большее количество рабочих мест.
И в целом такие компаии ищут сотрудников в большем количестве регионов страны.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [271]:
# текст запроса
query_6_1 = f'''
SELECT
    COUNT(v.id)
FROM vacancies v
WHERE LOWER(v.name) LIKE '%data%' OR LOWER(v.name) LIKE '%данн%'
'''

In [272]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_96484/366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [62]:
# текст запроса
query_6_2 = f'''
SELECT
    v.name
FROM vacancies v
WHERE (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND (LOWER(v.name) LIKE '%junior%' \
    OR LOWER(v.experience) LIKE '%нет опыта%' \
    OR LOWER(v.employment) LIKE '%стажировка%')
'''

In [64]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df.shape[0]

/var/folders/1q/8_2q81w95wl_3l_1dqn65j2m0000gp/T/ipykernel_15900/3455733300.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [108]:
# текст запроса
query_6_3 = f'''
SELECT
    v.name,
    v.key_skills
FROM vacancies v
WHERE \
    (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND \
    (LOWER(v.key_skills) LIKE '%sql%' \
    OR LOWER(v.key_skills) LIKE '%postgres%')
'''

In [110]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df.shape[0]

/var/folders/1q/8_2q81w95wl_3l_1dqn65j2m0000gp/T/ipykernel_15900/3717712165.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [134]:
# текст запроса
query_6_4 = f'''
(SELECT
    v.key_skills,
    COUNT(v.id)
FROM vacancies v
WHERE \
    (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND \
    LOWER(v.key_skills) LIKE '%python%'
GROUP BY 1)
UNION ALL
(SELECT
    'total',
    COUNT(v.id) 
FROM vacancies v
WHERE \
    (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND \
    LOWER(v.key_skills) LIKE '%python%'
GROUP BY 1)
ORDER BY 2 DESC

'''

In [136]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df.loc[0]['count']

/var/folders/1q/8_2q81w95wl_3l_1dqn65j2m0000gp/T/ipykernel_15900/728334595.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [225]:
# текст запроса
query_6_5 = f'''
SELECT
    ROUND(AVG(key_skills_count), 2) average_skills_count
FROM
(
SELECT
    LENGTH(v.key_skills) - LENGTH(REPLACE(v.key_skills, CHR(9), '')) + 1 key_skills_count
FROM vacancies v
WHERE
    (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND v.key_skills IS NOT NULL
) query
'''

In [226]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

/var/folders/1q/8_2q81w95wl_3l_1dqn65j2m0000gp/T/ipykernel_15900/3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   average_skills_count
0                  6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [43]:
# текст запроса
query_6_6 = f'''

SELECT
    ROUND(AVG(COALESCE((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0) salary,
    v.experience
FROM vacancies v
WHERE
    (LOWER(v.name) LIKE '%data scientist%' \
    OR LOWER(v.name) LIKE '%data science%' \
    OR LOWER(v.name) LIKE '%исследователь данных%' \
    OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%') \
    OR LOWER(v.name) LIKE '%machine learning%' \
    OR LOWER(v.name) LIKE '%машинн%обучен%') \
    AND (v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL)
GROUP BY 2
'''

In [44]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

/var/folders/yg/tkn4_xj95bzgl7fbb_hmrbcm0000gn/T/ipykernel_13575/519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

     salary          experience
0   74643.0           Нет опыта
1  139675.0  От 1 года до 3 лет
2  243115.0       От 3 до 6 лет

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
Интересно, что обладая в два раза большим опытом соискатели, в среднем, претендуют на в два раза больший доход.
Тем не менее, вряли стоит считать что зависимость здесь линейная.